<div  x-data="{ currentUrl: window.location.href }"
      class="flex flex-col gap-2 account_menu_wrap pt-8">
    <a :class="{ 'active': currentUrl.startsWith($el.href) }" wire:navigate
       href="{{route('account.mixtapes')}}">
        <svg width="23" height="24" viewBox="0 0 23 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd"
                  d="M11.5 0.5C16.2635 0.5 20.125 4.36154 20.125 9.125H15.3333C15.3333 7.00791 13.6171 5.29167 11.5 5.29167C9.38291 5.29167 7.66667 7.00791 7.66667 9.125H2.875C2.875 4.36154 6.73654 0.5 11.5 0.5ZM13.4167 9.125C13.4167 8.06645 12.5585 7.20833 11.5 7.20833C10.4415 7.20833 9.58333 8.06645 9.58333 9.125H13.4167Z"
                  fill="white"/>
            <path
                d="M0.958252 11.0417H22.0416V21.5001C22.0416 22.6047 21.1462 23.5001 20.0416 23.5001H2.95825C1.85368 23.5001 0.958252 22.6047 0.958252 21.5001V11.0417Z"
                fill="white"/>
        </svg>
        <h3> Микстейпы </h3>
    </a>

    <a :class="{ 'active': currentUrl.startsWith($el.href) }" wire:navigate
       href="{{route('account.distributions')}}">
        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
                d="M8 11C10.7614 11 13 8.76142 13 6C13 3.23858 10.7614 1 8 1C5.23858 1 3 3.23858 3 6C3 8.76142 5.23858 11 8 11Z"
                fill="#929292"/>
            <path
                d="M0 21C0 16.5817 3.58172 13 8 13C12.4183 13 16 16.5817 16 21C16 22.1046 15.1046 23 14 23H2C0.895431 23 0 22.1046 0 21Z"
                fill="#929292"/>
            <path
                d="M17 13C18.6569 13 20 11.6569 20 10C20 8.34315 18.6569 7 17 7C15.3431 7 14 8.34315 14 10C14 11.6569 15.3431 13 17 13Z"
                fill="#929292"/>
            <path d="M19 10V2L22 3" stroke="#929292" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
        </svg>
        <h3> Дистрибуция </h3>
    </a>

    <a :class="{ 'active': currentUrl.startsWith($el.href) }" wire:navigate
       href="{{route('account.tracks')}}">
        <svg xmlns="http://www.w3.org/2000/svg" width="32" height="32" fill="#000000" viewBox="0 0 256 256"><path d="M128,176a48.05,48.05,0,0,0,48-48V64a48,48,0,0,0-96,0v64A48.05,48.05,0,0,0,128,176ZM96,64a32,32,0,0,1,64,0v64a32,32,0,0,1-64,0Zm40,143.6V240a8,8,0,0,1-16,0V207.6A80.11,80.11,0,0,1,48,128a8,8,0,0,1,16,0,64,64,0,0,0,128,0,8,8,0,0,1,16,0A80.11,80.11,0,0,1,136,207.6Z"></path></svg>
        <h3> Треки и биты </h3>
    </a>

    <a :class="{ 'active': currentUrl.startsWith($el.href) }" wire:navigate
       href="{{route('account.settings')}}">
        <svg width="23" height="24" viewBox="0 0 23 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
                d="M2.875 15.8334H4.79167V21.5834C4.79167 22.1126 4.36261 22.5417 3.83333 22.5417C3.30406 22.5417 2.875 22.1126 2.875 21.5834V15.8334Z"
                fill="#929292"/>
            <path
                d="M10.5417 12.9584H12.4584V21.5834C12.4584 22.1126 12.0294 22.5417 11.5001 22.5417C10.9708 22.5417 10.5417 22.1126 10.5417 21.5834V12.9584Z"
                fill="#929292"/>
            <path
                d="M2.875 2.41658C2.875 1.88731 3.30406 1.45825 3.83333 1.45825C4.36261 1.45825 4.79167 1.88731 4.79167 2.41659V11.0416H2.875V2.41658Z"
                fill="#929292"/>
            <path
                d="M18.2083 15.8334H20.1249V21.5834C20.1249 22.1126 19.6959 22.5417 19.1666 22.5417C18.6373 22.5417 18.2083 22.1126 18.2083 21.5834V15.8334Z"
                fill="#929292"/>
            <path
                d="M18.2083 2.41658C18.2083 1.88731 18.6373 1.45825 19.1666 1.45825C19.6959 1.45825 20.1249 1.88731 20.1249 2.41659V11.0416H18.2083V2.41658Z"
                fill="#929292"/>
            <path
                d="M10.5417 2.41659C10.5417 1.88731 10.9708 1.45825 11.5001 1.45825C12.0294 1.45825 12.4584 1.88731 12.4584 2.41659V8.16659H10.5417V2.41659Z"
                fill="#929292"/>
            <rect x="15.3333" y="12.9584" width="7.66667" height="4.79167" rx="2" fill="#929292"/>
            <rect x="7.66675" y="6.25" width="7.66667" height="4.79167" rx="2" fill="#929292"/>
            <rect y="12.9584" width="7.66667" height="4.79167" rx="2" fill="#929292"/>
        </svg>
        <h3> Настройки </h3>
    </a>
</div>
